In [4]:
import pandas as pd

In [5]:
#Creating Series
series=pd.Series([5,6,7,8,9])
series

0    5
1    6
2    7
3    8
4    9
dtype: int64

In [6]:
series1=pd.Series([5.5,6,7,8,9])
series1

0    5.5
1    6.0
2    7.0
3    8.0
4    9.0
dtype: float64

In [7]:
series2=pd.Series(['Solitude', 'Soul','in', 'a', 'real', 'chaos'])
series2

0    Solitude
1        Soul
2          in
3           a
4        real
5       chaos
dtype: object

In [8]:
series2[2:5]

2      in
3       a
4    real
dtype: object

In [9]:
import numpy as np

In [10]:
series3 = pd.Series(np.arange(10))
series3

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [11]:
# Create a pandas series with 100 Zero values
series4 = pd.Series(np.zeros(100))
series4

0     0.0
1     0.0
2     0.0
3     0.0
4     0.0
     ...
95    0.0
96    0.0
97    0.0
98    0.0
99    0.0
Length: 100, dtype: float64

# reading files

In [14]:
pwd  # present working directory

'C:\\Users\\BAIDEHI SHARAN YADAV\\Desktop\\IBM Project\\Practices'

In [13]:
#importing data set
#data Frame
df=pd.read_csv('insurance.csv')
df

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

In [16]:
df.head()  #first five record will print

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [17]:
df.tail()  #Last five record will be print

      age     sex    bmi  children smoker     region     charges
1333   50    male  30.97         3     no  northwest  10600.5483
1334   18  female  31.92         0     no  northeast   2205.9808
1335   18  female  36.85         0     no  southeast   1629.8335
1336   21  female  25.80         0     no  southwest   2007.9450
1337   61  female  29.07         0    yes  northwest  29141.3603

In [18]:
list(df)

['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges']

In [23]:
df.age

0       19
1       18
2       28
3       33
4       32
        ..
1333    50
1334    18
1335    18
1336    21
1337    61
Name: age, Length: 1338, dtype: int64

In [21]:
df.shape

(1338, 7)

In [24]:
df.isnull().sum()  # Checking null values in data Set

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [26]:
df['age']

0       19
1       18
2       28
3       33
4       32
        ..
1333    50
1334    18
1335    18
1336    21
1337    61
Name: age, Length: 1338, dtype: int64

In [27]:
df[5:9]

   age     sex    bmi  children smoker     region    charges
5   31  female  25.74         0     no  southeast  3756.6216
6   46  female  33.44         1     no  southeast  8240.5896
7   37  female  27.74         3     no  northwest  7281.5056
8   37    male  29.83         2     no  northeast  6406.4107

# Slicing Operators

In [30]:
# iloc = index Location
df.head(10)

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520
5   31  female  25.740         0     no  southeast   3756.62160
6   46  female  33.440         1     no  southeast   8240.58960
7   37  female  27.740         3     no  northwest   7281.50560
8   37    male  29.830         2     no  northeast   6406.41070
9   60  female  25.840         0     no  northwest  28923.13692

In [31]:
df.iloc[3:7, 2:6]

      bmi  children smoker     region
3  22.705         0     no  northwest
4  28.880         0     no  northwest
5  25.740         0     no  southeast
6  33.440         1     no  southeast

In [34]:
df.loc[7]

age                37
sex            female
bmi             27.74
children            3
smoker             no
region      northwest
charges       7281.51
Name: 7, dtype: object

In [35]:
df.isnull().any()

age         False
sex         False
bmi         False
children    False
smoker      False
region      False
charges     False
dtype: bool

In [36]:
#creating new data frame
df1 = df.loc[1:6, 'age':'region']
df1

   age     sex     bmi  children smoker     region
1   18    male  33.770         1     no  southeast
2   28    male  33.000         3     no  southeast
3   33    male  22.705         0     no  northwest
4   32    male  28.880         0     no  northwest
5   31  female  25.740         0     no  southeast
6   46  female  33.440         1     no  southeast

In [39]:
df1.index.to_list()

[1, 2, 3, 4, 5, 6]

In [41]:
df1.columns.to_list()

['age', 'sex', 'bmi', 'children', 'smoker', 'region']

In [44]:
#create a dataframe with 5 columns and 10 rows and name the column
df2 = pd.DataFrame(np.arange(50).reshape(10,5))
df2.columns = ['c1','c2','c3','c4','c5']
df2

   c1  c2  c3  c4  c5
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24
5  25  26  27  28  29
6  30  31  32  33  34
7  35  36  37  38  39
8  40  41  42  43  44
9  45  46  47  48  49

In [46]:
df1

   age     sex     bmi  children smoker     region
1   18    male  33.770         1     no  southeast
2   28    male  33.000         3     no  southeast
3   33    male  22.705         0     no  northwest
4   32    male  28.880         0     no  northwest
5   31  female  25.740         0     no  southeast
6   46  female  33.440         1     no  southeast

In [47]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 1 to 6
Data columns (total 6 columns):
age         6 non-null int64
sex         6 non-null object
bmi         6 non-null float64
children    6 non-null int64
smoker      6 non-null object
region      6 non-null object
dtypes: float64(1), int64(2), object(3)
memory usage: 420.0+ bytes

In [48]:
df1.describe()  # to display all the descriptive statistics (like mean, count, standard Deviation)

             age        bmi  children
count   6.000000   6.000000  6.000000
mean   31.333333  29.589167  0.833333
std     9.025889   4.618502  1.169045
min    18.000000  22.705000  0.000000
25%    28.750000  26.525000  0.000000
50%    31.500000  30.940000  0.500000
75%    32.750000  33.330000  1.000000
max    46.000000  33.770000  3.000000

In [49]:
df1

   age     sex     bmi  children smoker     region
1   18    male  33.770         1     no  southeast
2   28    male  33.000         3     no  southeast
3   33    male  22.705         0     no  northwest
4   32    male  28.880         0     no  northwest
5   31  female  25.740         0     no  southeast
6   46  female  33.440         1     no  southeast

In [50]:
df1[df1.age>18]

   age     sex     bmi  children smoker     region
2   28    male  33.000         3     no  southeast
3   33    male  22.705         0     no  northwest
4   32    male  28.880         0     no  northwest
5   31  female  25.740         0     no  southeast
6   46  female  33.440         1     no  southeast

In [51]:
df1[df1.children==0]

   age     sex     bmi  children smoker     region
3   33    male  22.705         0     no  northwest
4   32    male  28.880         0     no  northwest
5   31  female  25.740         0     no  southeast

In [52]:
df1[df1.children==0].shape

(3, 6)

In [67]:
df1[(df1.bmi>20) & (df1.age>18)]

   age     sex     bmi  children smoker     region
2   28    male  33.000         3     no  southeast
3   33    male  22.705         0     no  northwest
4   32    male  28.880         0     no  northwest
5   31  female  25.740         0     no  southeast
6   46  female  33.440         1     no  southeast

In [68]:
df1[(df1.bmi>20) & (df1.age>18)].shape

(5, 6)

In [73]:
df1.sort_values('age', ascending=True)

   age     sex     bmi  children smoker     region
1   18    male  33.770         1     no  southeast
2   28    male  33.000         3     no  southeast
5   31  female  25.740         0     no  southeast
4   32    male  28.880         0     no  northwest
3   33    male  22.705         0     no  northwest
6   46  female  33.440         1     no  southeast

In [74]:
df1.sort_values('age', ascending=False)

   age     sex     bmi  children smoker     region
6   46  female  33.440         1     no  southeast
3   33    male  22.705         0     no  northwest
4   32    male  28.880         0     no  northwest
5   31  female  25.740         0     no  southeast
2   28    male  33.000         3     no  southeast
1   18    male  33.770         1     no  southeast

In [77]:
df1.sort_values(['age', 'children'], ascending=[True,True])

   age     sex     bmi  children smoker     region
1   18    male  33.770         1     no  southeast
2   28    male  33.000         3     no  southeast
5   31  female  25.740         0     no  southeast
4   32    male  28.880         0     no  northwest
3   33    male  22.705         0     no  northwest
6   46  female  33.440         1     no  southeast

# Unique

In [78]:
df1.head()  #first five

   age     sex     bmi  children smoker     region
1   18    male  33.770         1     no  southeast
2   28    male  33.000         3     no  southeast
3   33    male  22.705         0     no  northwest
4   32    male  28.880         0     no  northwest
5   31  female  25.740         0     no  southeast

In [79]:
df1.age.unique()

array([18, 28, 33, 32, 31, 46], dtype=int64)

In [80]:
df1.bmi.unique()

array([33.77 , 33.   , 22.705, 28.88 , 25.74 , 33.44 ])

# value_counts

In [81]:
df1.age.value_counts()

31    1
46    1
28    1
18    1
33    1
32    1
Name: age, dtype: int64

In [82]:
df1.sex.value_counts()

male      4
female    2
Name: sex, dtype: int64

In [83]:
df1.children.value_counts()

0    3
1    2
3    1
Name: children, dtype: int64

In [85]:
df1.shape

(6, 6)

In [87]:
df1.isnull().any()

age         False
sex         False
bmi         False
children    False
smoker      False
region      False
dtype: bool

In [93]:
dd = pd.DataFrame({
    'name' : ['mack', 'max', 'steve', 'jhon'],
    'maths' : [79,78,98,96]
})
dd

    name  maths
0   mack     79
1    max     78
2  steve     98
3   jhon     96

In [94]:
dr = pd.DataFrame({
    'name' : ['mack', 'max', 'steve', 'jhon'],
    'science' : [97,90,96,90]
})
dr

    name  science
0   mack       97
1    max       90
2  steve       96
3   jhon       90

In [99]:
# merge two data frame
m1=pd.merge(dd,dr,on='name')
m1

    name  maths  science
0   mack     79       97
1    max     78       90
2  steve     98       96
3   jhon     96       90